[
  {
    "name": "1st Step",
    "text": "Dear God, I admit that I am powerless over lust. I admit that my life is unmanageable when I try to control it. Help me this day to understand the true meaning of powerlessness. Remove from me all denial of my addiction."
  },
  {
    "name": "1st Step II",
    "text": "I admit that I am powerless over lust.  My life has become unmanageable. (AA p. 29, SA p. 83)"
  },
  {
    "name": "2nd Step",
    "text": "Heavenly Father, I know in my heart that only you can restore me to sanity. I humbly ask that you remove all twisted thought and addictive behavior from me this day. Heal my spirit and restore in me a clear mind."
  },
  {
    "name": "2nd Step II",
    "text": "Without help, it is too much for me.  But there is One who has all power--that One is God. May I find God now!  Half measures avail me nothing.  I stand at the turning point. I ask God's protection and care with complete abandon. (AA p. 59)"
  },
  {
    "name": "3rd Step",
    "text": "God, I offer myself to Thee to build with me and to do with me as Thou wilt. Relieve me of the bondage of self, that I may better do Thy will. Take away my difficulties, that victory over them may bear witness to those I would help of Thy Power, Thy Love and Thy Way of life, May I do Thy will always! (AA p. 63)."
  },
  {
    "name": "4th Step",
    "text": "Dear God, It is I who has made my life a mess. I have done it, but I cannot undo it. My mistakes are mine, and I will begin a searching and fearless moral inventory. I will write down my wrongs, but I will also include that which is good. I pray for the strength to complete the task.z"
  },
  {
    "name": "4th Step II",
    "text": "When resentful: God, help me to show [this person or institution] the same tolerance, pity, and patience that I would cheerfully grant a sick friend. This is a sick person. How can I be helpful to him? God save me from being angry. Thy will be done. (AA p. 63)."
  },
  {
    "name": "4th Step II",
    "text": "When afraid: God, remove my fear from me and direct my attention to what you would have me be.  I ask in Your name.  (AA p. 68)"
  },
  {
    "name": "4th Step IV",
    "text": "When aware of own defects and seeking God's help to change: God, mould my ideals in this particular area of my life and help me to live up to them.  What should I do in each specific matter?  I earnestly pray for the right ideal, for guidance in each questionable situation, for sanity, and for the strength to do the right thing. (AA pp. 69-70)."
  },
  {
    "name": "5th Step",
    "text": "God, my inventory has shown me who I am. I now ask for Your help in admitting my wrongs to another person and to You. Assure me, and be with me, in this Step, for without this Step I cannot progress in my recovery. With Your help, I can do this, and I do it."
  },
  {
    "name": "5th Step II",
    "text": "God, I thank you from the bottom of my heart that I know you better.  Help me become aware of anything I have omitted to tell another person.  Help me to do what is necessary to walk as a free person at last.  (AA p. 75)."
  },
  {
    "name": "6th Step",
    "text": "Dear God, I am ready for Your help in removing from me the defects of character which I now realize are an obstacle to my recovery. Help me to continue being honest with myself and guide me toward spiritual and mental health."
  },
  {
    "name": "6th Step II",
    "text": "I have emphasized willingness as being indispensable.  I am now ready to let God remove from me all things, which I have admitted are objectionable.  If I still cling to something I will not let go, I ask God to help me be willing.  (AA p. 76)"
  },
  {
    "name": "7th Step",
    "text": "My Creator, I am now willing that you should have all of me, good and bad. I pray that you now remove from me every single defect of character which stands in the way of my usefulness to you and my fellows. Grant me strength, as I go out from here to do your bidding. Amen (AA p. 76)"
  },
  {
    "name": "8th Step",
    "text": "Dear God, I ask for Your help in making my list of all those I have harmed. I will take responsibility for my mistakes, and be forgiving to others as You are forgiving to me. Grant me the willingness to begin my restitution. This I pray."
  },
  {
    "name": "8th Step II",
    "text": "God, help me to become willing to sweep away the debris which has accumulated out of my effort to live on self-will.  God, Thy Will be done for this person, as well as for me.  (AA p. 76)"
  },
  {
    "name": "9th Step",
    "text": "God, I pray for the right attitude to make my amends, being ever mindful not to harm others in the process. I ask for Your guidance in making indirect amends. Most important, I will continue to make amends by staying abstinent, helping others, and growing in spiritual progress."
  },
  {
    "name": "9th Step II",
    "text": "God,  give me the strength and direction to do the right thing no matter what the consequences may be.  Help me consider others and not harm them in any way.  Help me consult with others before I take any actions that would cause me to be sorry.  Help me not to repeat such behavior.  Show me the way of Patience, Tolerance, Kindliness and Love, and to help me live the spiritual life.   (AA pp. 79, 80, 83)"
  },
  {
    "name": "10th Step",
    "text": "I pray I may continue: To grow in understanding and effectiveness; To take daily spot check inventories of myself; To correct mistakes when I make them; To take responsibility for my actions; To be ever aware of my negative and self-defeating attitudes and behaviors; to keep my willfulness in check; To always remember I need Your help; To keep love and tolerance of others as my code; And to continue to ask, in daily prayer, how I can best serve You, my God."
  },
  {
    "name": "10th Step II",
    "text": "God, remove the selfishness, dishonesty, resentment, and fear that have cropped up in my life right now.  Help me to discuss this with someone immediately and make amends quickly, if I have harmed anyone.  Help me to cease fighting anything or anyone.  Show me where I can be helpful to someone else.  Help me to react sanely, not cocky and afraid.  How can I best serve Thee?  Thy will (not mine) be done. (AA pp. 84-85)"
  },
  {
    "name": "11th Step",
    "text": "Dear God, as I understand You, I pray to keep my connection with You open and clear from the confusion of daily life. Through my prayers and meditation I ask especially for freedom from self-will, rationalization, and wishful thinking. I pray for the guidance of correct thought and positive action. Your will Higher Power, not mine, be done."
  },
  {
    "name": "11th Step II",
    "text": "L-rd, make me an instrument of your peace. Where there is hatred, let me sow love; where there is injury, pardon; where there is doubt, faith; where there is despair, hope; where there is darkness, light; and where there is sadness, joy. O Divine Master, grant that I may not so much seek to be consoled as to console; to be understood as to understand; to be loved as to love. For it is in giving that we receive; it is in pardoning that we are pardoned; and it is in dying that we are born to eternal life. Amen"
  },
  {
    "name": "11th Step III",
    "text": "Night Prayer: God, forgive me when I have been resentful, selfish, dishonest, and afraid today.  Help me to not keep anything to myself, but to discuss it openly with another person.  Show me where I owe an apology and help me make it.  Help me to be kind and loving to all people.  Help me to think of what I could do for others.  Please help me not to drift into worry, remorse, or morbid reflection, so that I may be of use to others.  (AA p. 86)"
  },
  {
    "name": "11th Step IV",
    "text": "Day Prayer: God, direct my thinking today so that it be divorced from self pity, dishonesty, self-will, self-seeking, and fear.  Inspire my thinking, decisions, and intuitions.  Help me to relax and take it easy.  Free me from doubt and indecision.  Guide me through this day and show me my next right step.  God, give me what I need to take care of any problem.  I ask, especially for freedom from self-will.  I ask all these things that I may be of maximum service to You and everyone in my sphere. (AA pp. 86-87)"
  },
  {
    "name": "11th Step V",
    "text": "As I go through the day: God, I'm agitated, and (fearful) doubtful right now.  Help me to stop and remember that I'm no longer running the show.  Give me the right thoughts and actions to help me in these specific situations. God, save me from fear, anger, worry, self-pity, or foolish decisions. Your will be done. (AA pp. 87-88)"
  },
  {
    "name": "12th Step",
    "text": "Dear God, My spiritual awakening continues to unfold. The help I have received I shall pass on and give to others, both in and out of the Fellowship. For this opportunity I am grateful. I pray most humbly to continue walking day by day on the road of spiritual progress. I pray for the inner strength and wisdom to practice the principles of this way of life in all I do and say. I need You, my friends and this Program every hour of every day. This is a better way to live."
  },
  {
    "name": "12th Step II",
    "text": "God, I ask you what I can do today for the person who is still sick.  Please help me put my own house in order, and I believe that the answers will come.  Help me make my relationship with You right, then great events will come to pass for me and countless others.  That is the Great Fact, for us.  Help me abandon myself to You.  Help me admit my faults to You and to my fellows.  Help me clear away the wreckage of my past.  Help me give freely of what I have found and join with others.  May God bless us and keep us. (AA p. 164)"
  },
  {
    "name": "Our Father Prayer",
    "text": "Our Father, Who art in heaven, hallowed be Thy Name; Thy kingdom come, Thy will be done, on earth as it is in heaven. Give us this day our daily bread, and forgive us our trespasses, as we forgive those who trespass against us; and lead us not into temptation, but deliver us from evil. Amen."
  },
  {
    "name": "Serenity Prayer",
    "text": "God, grant me the serenity to accept the things I cannot change, courage to change the things I can and wisdom to know the difference."
  }
]
