[
  {
    "name": "MODLITBA VYROVNANOSTI",
    "text": "Bože, daj mi vyrovnanosť, aby som prijal to, čo zmeniť nemôžem, odvahu, aby som zmenil to, čo zmeniť môžem, a múdrosť, aby som vedel odlíšiť jedno od druhého. Nech sa deje Tvoja vôľa a nie moja. Amen."
  },
  {
    "name": "OSLOBODENIE OD ŽIADOSTIVOSTI",
    "text": "Pane, vzdávam sa svojej žiadostivosti a prosím Ťa, aby si ma dnes udržal triezveho  od mojej žiadostivosti, lebo ja to nedokážem; ale Tvojou mocou môžem."
  },
  {
    "name": "MODLITBA BEZMOCNOSTI",
    "text": "Som bezmocný, prosím, pomôž mi!"
  },
  {
    "name": "VZDANIE SA TÚŽBY",
    "text": "Vzdávam sa práva žiadostivo túžiť po tomto človeku, prosím, zober to preč."
  },
  {
    "name": "MODLITBA 3. KROKU",
    "text": "Prosím, udrž ma dnes triezveho od mojej žiadostivosti, lebo ja nemôžem... Ponúkam ti dnes svoju vôľu a život, aby si s nimi narábal a budoval, ako ty chceš. Osloboď ma dnes od pút mňa samého, aby som mohol lepšie plniť tvoju vôľu. Odstráň dnes moje ťažkosti, aby víťazstvo nad nimi mohlo svedčiť o tvojej veľkej moci, láske a spôsobe života tým, ktorým budem pomáhať. Daj mi, čo dnes potrebujem. Nech sa dnes deje tvoja vôľa a nie moja."
  },
  {
    "name": "MODLITBA ZA OSOBU",
    "text": "Bože, požehnaj ju a daj je, čo potrebuje. Bože, požehnaj ju a sprav ju požehnaním. Nech sa v jej živote deje Tvoja vôľa."
  },
  {
    "name": "MODLITBA TÚŽBY PO BOHU",
    "text": "Čokoľvek je to, čo teraz hľadám, daj, nech to nájdem v Tebe môj Bože."
  },
  {
    "name": "MODLITBA OCHRANY PRED ŽIADOSTIVOSŤOU",
    "text": "Beriem si Tvoju prítomnosť Bože, aby ma ako štít ochránila pred mojou žiadostivosťou. Nechcem žiadnu časť z tejto žiadostivosti. Chcem, aby si to odo mňa zobral."
  },
  {
    "name": "MODLITBA OCHRANY PRED ŽIADOSTIVOSŤOU - PRED SPÁNKOM",
    "text": "Ty poznáš moje srdce, ako skutočne chcem žiadostivo túžiť. Posielam to Tebe. Príď a zvíťaz nad mojou žiadostivosťou. Nechcem z nej ani kúsok – vedomý ani podvedomý. Chcem, aby si ju Ty niesol za mňa. Prosím, udrž ma dnes v noci triezveho od všetkej mojej žiadostivosti."
  },
  {
    "name": "MODLITBA 3. KROKU AA",
    "text": "Bože, odovzdávam sa Ti, aby si ma formoval a naložil so mnou podľa svojej vôle, osloboď ma zo zajatia môjho ja, aby som lepšie mohol vykonávať Tvoju vôľu. Odbremeň ma od mojich ťažkostí, aby sa víťazstvo nad nimi stalo svedectvom pre tých, ktorým sa môžem Tvojou mocou, Tvojou láskou, Tvojím spôsobom života stať nápomocným. Kiež by som vždy plnil Tvoju vôľu."
  },
  {
    "name": "MODLITBA 1. KROKU",
    "text": "Drahý Pane, priznávam, že som bezmocný nad žiadostivosťou.  Priznávam, že môj život je nezvládnuteľný, keď sa ho snažím kontrolovať. Pomôž mi v tento deň chápať pravý význam bezmocnosti. Odstráň zo mňa všetko popieranie mojej závislosti."
  },
  {
    "name": "MODLITBA 2. KROKU",
    "text": "Nebeský Otče, vo svojom srdci viem, že len ty ma môžeš priviesť k príčetnosti. Pokorne Ťa prosím, aby si odo mňa v dnešný deň odstránil každú pokrútenú myšlienku a závislé správanie. Uzdrav môjho ducha a obnov vo mne jasnú myseľ."
  },
  {
    "name": "MODLITBA 4. KROKU",
    "text": "Drahý Bože, som to ja, kto narobil v mojom živote neporiadok. Ja som ho spravil, ale neviem ho odstrániť. Moje chyby sú moje a ja začnem so skúmaním a nebojácnou morálnou inventúrou. Spíšem svoje chyby, ale zahrniem aj to, čo je dobré. Modlím sa o silu dokončiť tú úlohu."
  },
  {
    "name": "MODLITBA 4. KROKU PRI RESENTIMENTE",
    "text": "Bože, pomôž mi prejaviť tomuto človeku takú istú toleranciu, súcit a trpezlivosť,  akú by som s radosťou preukázal chorému priateľovi. Toto je chorý človek. Ako mu môžem byť nápomocný? Bože, chráň ma od hnevu. Nech sa deje Tvoja vôľa."
  },
  {
    "name": "MODLITBA 4. KROKU PRI STRACHU",
    "text": "Bože, odstráň odo mňa môj strach a upriam moju pozornosť na to, čo by si zo mňa chcel mať. Prosím Ťa v Tvojom mene."
  },
  {
    "name": "MODLITBA 4. KROKU - TÚŽBA PO ZMENE",
    "text": "Bože, tvaruj moje ideály v tejto konkrétnej oblasti môjho života a pomôž mi dosiahnuť ich. Čo by som mal robiť v každej konkrétnej záležitosti? Úprimne sa modlím o pravý ideál, o vedenie v každej nejasnej situácii, o príčetnosť a o silu urobiť tú správnu vec."
  },
  {
    "name": "MODLITBA 5. KROKU",
    "text": "Bože, moja inventúra mi ukázala, kto som. Teraz Ťa prosím o pomoc pri priznávaní mojich chýb inému človeku a Tebe. Uisťuj ma a buď so mnou v tomto kroku, pretože bez tohto kroku nemôžem napredovať vo svojom uzdravovaní. S Tvojou pomocou to môžem urobiť a robím to."
  },
  {
    "name": "MODLITBA 5. KROKU - 2",
    "text": "Bože, ďakujem Ti z hĺbky srdca, že Ťa lepšie poznám. Pomôž mi uvedomiť si čokoľvek, čo som nepovedal druhej osobe. Pomôž mi urobiť to, čo je nutné, aby som mohol konečne kráčať ako slobodný človek."
  },
  {
    "name": "MODLITBA 6. KROKU",
    "text": "Drahý Bože, som pripravený na Tvoju pomoc v odstraňovaní defektov môjho charakteru, o ktorých si teraz uvedomujem, že bránia môjmu uzdravovaniu. Pomôž mi naďalej byť voči sebe úprimný a veď ma k duchovnému a mentálnemu zdraviu."
  },
  {
    "name": "MODLITBA 6. KROKU - 2",
    "text": "Bože môj. Viem že ochota je nenahraditeľná. Teraz som pripravený na to, aby som Ti dovolil odstrániť zo mňa všetky veci, o ktorých som priznal, že sú nevyhovujúce. Ak sa stále niečoho držím a nechcem to pustiť, prosím Ťa Bože, daj mi ochotu."
  },
  {
    "name": "MODLITBA 7. KROKU",
    "text": "Môj stvoriteľ, som teraz ochotný, aby si mal zo mňa všetko – dobré aj zlé. Modlím sa, aby si mi odstránil každú jednu charakterovú vadu, ktorá prekáža mojej užitočnosti Tebe a mojim blížnym. Daruj mi silu, keď sa pustím plniť Tvoje pokyny. Amen."
  },
  {
    "name": "MODLITBA 8. KROKU",
    "text": "Drahý Bože, prosím o Tvoju pomoc, keď budem robiť zoznam tých, ktorým som ublížil. Prevezmem zodpovednosť za svoje chyby a budem druhým odpúšťať tak, ako Ty odpúšťaš mne. Daj mi ochotu začať s mojím odškodňovaním. O to sa modlím."
  },
  {
    "name": "MODLITBA 8. KROKU - 2",
    "text": "Bože, pomôž mi stať sa ochotným pozametať všetky trosky, ktoré sa nahromadili vďaka mojej snahe žiť si podľa mojej vôle. Bože, nech sa deje Tvoja vôľa pre túto osobu takisto ako aj pre mňa."
  },
  {
    "name": "MODLITBA 9. KROKU",
    "text": "Bože, modlím sa za správny postoj na robenie náprav, vždy dávajúc pozor na to, aby som pri tom nezranil iných ľudí. Prosím o Tvoje vedenie pri robení nepriamych náprav. A predovšetkým budem pokračovať v robení náprav tým, že budem abstinovať, pomáhať iným a napredovať v duchovnom pokroku."
  },
  {
    "name": "MODLITBA 9. KROKU - 2",
    "text": "Bože, daj mi silu a usmernenie, aby som urobil tú správnu vec bez ohľadu na to, aké by mohli byť následky. Pomôž mi brať ohľad na druhých a nijakým spôsobom im neublížiť. Pomôž mi poradiť sa s inými skôr, než urobím hocičo, čo by mi mohlo byť ľúto. Pomôž mi neopakovať také správanie. Ukáž mi cestu trpezlivosti, tolerancie, dobrosrdečnosti a lásky a pomôž mi žiť duchovný život."
  },
  {
    "name": "MODLITBA 10. KROKU",
    "text": "Modlím sa, aby som mohol pokračovať: v raste v chápaní a užitočnosti; v robení denných priebežných inventúr seba samého; v naprávaní chýb, keď ich urobím; v preberaní zodpovednosti za svoje skutky; v uvedomovaní si svojich negatívnych a škodiacich postojoch a správaní; v obmedzovaní svojej svojhlavosti; v stálom pamätaní si, že potrebujem Tvoju pomoc; v tom, aby som mal lásku a toleranciu voči iným ako svoj zákon; a v tom, aby som sa v každodennej modlitbe pýtal, ako Ti môžem najlepšie slúžiť, môj Bože."
  },
  {
    "name": "MODLITBA 10. KROKU - 2",
    "text": "Bože, odstráň to sebectvo, neúprimnosť, resentiment a strach, ktorý sa práve teraz vynoril v mojom živote. Pomôž mi to okamžite s niekým pozdieľať a urobiť rýchlo nápravu, ak som niekomu ublížil. Pomôž mi prestať bojovať s kýmkoľvek a čímkoľvek. Ukáž mi, kde môžem byť niekomu nápomocný. Pomôž mi reagovať príčetne, nie namyslene a vystrašene. Ako Ti môžem najlepšie poslúžiť? Tvoja voľa (nie moja) nech sa stane."
  },
  {
    "name": "MODLITBA 11. KROKU",
    "text": "Drahý Bože, taký ako Ťa chápem, modlím sa, aby som udržiaval spojenie s Tebou otvorené a čisté od zmätku každodenného života. Skrz svoje modlitby a meditáciu prosím obzvlášť o slobodu od svojvôle, odôvodňovania a túžobných prianí. Modlím sa o vedenie k správnemu mysleniu a pozitívnej činnosti. Nech sa deje nie moja, ale Tvoja vôľa, môj Bože."
  },
  {
    "name": "MODLITBA 11. KROKU - 2",
    "text": "Pane, urob ma nástrojom Tvojho pokoja. Kde je nenávisť, nech zasievam lásku; kde je zranenie, zmierenie; kde je pochybnosť, vieru; kde je zúfalstvo, nádej; kde je temnota; svetlo; a kde je smútok, radosť. Ó, Božský Učiteľ, daj, aby som radšej chcel utešiť, než byť utešený; pochopiť, než byť pochopený; milovať, než byť milovaný. Pretože keď dávame, tak dostávame; v odpúšťaní je nám odpustené a umieraním sa rodíme pre večný život. Amen."
  },
  {
    "name": "VEČERNÁ MODLITBA",
    "text": "Bože, odpusť mi, keď som dnes mal resentiment, bol som sebecký, nečestný a vystrašený. Pomôž mi nič si nenechať pre seba, ale otvorene o tom hovoriť s iným človekom. Ukáž mi, kde dlhujem ospravedlnenie a pomôž mi ho zrealizovať. Pomôž mi byť milý a láskavý ku všetkým ľuďom. Pomôž mi myslieť na to, čo môžem urobiť pre iných. Prosím, pomôž mi neskĺznuť do obáv, výčitiek a k morbídnym úvahám, aby som mohol byť užitočný pre iných."
  },
  {
    "name": "RANNÁ MODLITBA",
    "text": "Bože, usmerňuj dnes moje myslenie, aby bolo zbavené sebaľútosti, neúprimnosti, svojhlavosti, sebectva a strachu. Inšpiruj moje myslenie, rozhodovanie a intuíciu. Pomôž mi byť uvoľnený a v pohode. Osloboď ma od pochybností a nerozhodnosti. Veď ma cez tento deň a ukazuj mi môj ďalší krok. Bože, daj mi, čo potrebujem na vyriešenie každého problému. Žiadam predovšetkým o slobodu od svojhlavosti. Prosím o všetky tieto veci, aby som mohol byť maximálne k službám Tebe a každému vo svojom okolí."
  },
  {
    "name": "MODLITBA V PRIEBEHU DŇA",
    "text": "Bože, práve som rozrušený, vystrašený a pochybujúci. Pomôž mi zastaviť sa a spomenúť si, že už viac neriadim celé predstavenie. Daj mi tie správne myšlienky a činy, ktoré mi pomôžu v týchto konkrétnych situáciách. Bože, ochráň ma od strachu, hnevu, obáv, sebaľútosti alebo hlúpych rozhodnutí. Nech sa deje Tvoja vôľa."
  },
  {
    "name": "MODLITBA 12. KROKU",
    "text": "Drahý Bože, moje duchovné prebudenie sa naďalej rozvíja. Tú pomoc, ktorú som dostal, budem dávať ďalej, v spoločenstve aj mimo neho. Som vďačný za túto príležitosť. Veľmi pokorne prosím, aby som pokračoval deň čo deň kráčajúc po ceste duchovného rastu. Modlím sa o vnútornú silu a múdrosť praktizovať princípy tohto spôsobu života vo všetkom, čo robím a hovorím. Potrebujem Teba, svojich priateľov a tento program každú hodinu každého dňa. Toto je lepší spôsob života."
  },
  {
    "name": "MODLITBA 12. KROKU - 2",
    "text": "Bože, pýtam sa Ťa, čo môžem dnes urobiť pre toho, kto je ešte stále chorý. Prosím, pomôž mi pozametať si pred vlastným prahom a verím, že odpovede sa dostavia. Pomôž mi urobiť môj vzťah s Tebou správny, potom sa udejú veľké veci pre mňa a mnohých ďalších. Toto je pre mňa veľká skutočnosť. Pomôž mi odovzdať sa Ti. Pomôž mi priznať moje chyby Tebe a mojim priateľom. Pomôž mi odstrániť trosky mojej minulosti. Pomôž mi dať zadarmo z toho, čo som našiel a pridať sa k ostatným. Žehnaj nás a chráň nás."
  }
]
